Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_qdec.c
/**
 ******************************************************************************
 * @file    bl702_qdec.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_qdec.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  QDEC
 *  @{
 */

/** @defgroup  QDEC_Private_Macros
 *  @{
 */

/*@} end of group QDEC_Private_Macros */

/** @defgroup  QDEC_Private_Types
 *  @{
 */

/*@} end of group QDEC_Private_Types */

/** @defgroup  QDEC_Private_Variables
 *  @{
 */
static const uint32_t    qdecAddr[QDEC_ID_MAX]                     = {QDEC0_BASE, QDEC1_BASE, QDEC2_BASE};
static intCallback_Type *qdecIntCbfArra[QDEC_ID_MAX][QDEC_INT_ALL] = {{NULL, NULL, NULL, NULL}, {NULL, NULL, NULL, NULL}, {NULL, NULL, NULL, NULL}};

/*@} end of group QDEC_Private_Variables */

/** @defgroup  QDEC_Global_Variables
 *  @{
 */

/*@} end of group QDEC_Global_Variables */

/** @defgroup  QDEC_Private_Fun_Declaration
 *  @{
 */

/*@} end of group QDEC_Private_Fun_Declaration */

/** @defgroup  QDEC_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  QDEC init
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  qdecCfg: QDEC config
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_Init(QDEC_ID_Type qdecId, QDEC_CFG_Type *qdecCfg) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  CHECK_PARAM(IS_QDEC_SAMPLE_MODE_TYPE(qdecCfg->sampleCfg.sampleMod));
  CHECK_PARAM(IS_QDEC_SAMPLE_PERIOD_TYPE(qdecCfg->sampleCfg.samplePeriod));
  CHECK_PARAM(IS_QDEC_REPORT_MODE_TYPE(qdecCfg->reportCfg.reportMod));
  CHECK_PARAM((qdecCfg->ledCfg.ledPeriod) <= 0x1FF);
  CHECK_PARAM((qdecCfg->deglitchCfg.deglitchStrength) <= 0xF);

  /* qdec_ctrl */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_PERIOD, qdecCfg->sampleCfg.samplePeriod);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_PERIOD, qdecCfg->reportCfg.reportPeriod);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_EN, qdecCfg->ledCfg.ledEn);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_POL, qdecCfg->ledCfg.ledSwap);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DEG_EN, qdecCfg->deglitchCfg.deglitchEn);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DEG_CNT, qdecCfg->deglitchCfg.deglitchStrength);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);

  /* qdec_ctrl1 */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_MODE, qdecCfg->sampleCfg.sampleMod);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_MODE, qdecCfg->reportCfg.reportMod);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_PERIOD, qdecCfg->ledCfg.ledPeriod);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_ACC_MODE, qdecCfg->accMod);
  BL_WR_REG(QDECx, QDEC0_CTRL1, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(QDEC0_IRQn, QDEC0_IRQHandler);
  Interrupt_Handler_Register(QDEC1_IRQn, QDEC1_IRQHandler);
  Interrupt_Handler_Register(QDEC2_IRQn, QDEC2_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC deinit
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_DeInit(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* deconfig qdec */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_PERIOD, 10);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_PERIOD, 2);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DEG_CNT, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DEG_EN, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_POL, 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_EN, 0);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_LED_PERIOD, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_INPUT_SWAP, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_MODE, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_MODE, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_ACC_MODE, 1);
  BL_WR_REG(QDECx, QDEC0_CTRL1, tmpVal);

