Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_qdec.c
  /* enable qdec */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_EN, 1);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);

  /* deconfig interrupt */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_EN);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_OVERFLOW_EN, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DBL_RDY_EN, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_RDY_EN, 0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_RDY_EN, 1);
  BL_WR_REG(QDECx, QDEC0_INT_EN, tmpVal);

  /* clear status */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_CLR);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_OVERFLOW_CLR, 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DBL_RDY_CLR, 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_RDY_CLR, 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_RDY_CLR, 1);
  BL_WR_REG(QDECx, QDEC0_INT_STS, tmpVal);

  /* clear value */
  tmpVal = BL_RD_REG(QDECx, QDEC0_VALUE);

  /* disable qdec */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_EN, 0);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC enable
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_Enable(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* qdec_ctrl */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_SET_REG_BIT(tmpVal, QDEC_EN);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC disable
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_Disable(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* qdec_ctrl */
  tmpVal = BL_RD_REG(QDECx, QDEC0_CTRL0);
  tmpVal = BL_CLR_REG_BIT(tmpVal, QDEC_EN);
  BL_WR_REG(QDECx, QDEC0_CTRL0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  set QDEC interrupt mask
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                * @param  intMask: MASK or UNMASK
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_SetIntMask(QDEC_ID_Type qdecId, QDEC_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  CHECK_PARAM(IS_QDEC_INT_TYPE(intType));

  /* qdec_int_en */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_EN);

  switch (intType) {
  case QDEC_INT_REPORT:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_RPT_RDY_EN, (intMask ? 0 : 1));
    break;

  case QDEC_INT_SAMPLE:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_SPL_RDY_EN, (intMask ? 0 : 1));
    break;

  case QDEC_INT_ERROR:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_DBL_RDY_EN, (intMask ? 0 : 1));
    break;

  case QDEC_INT_OVERFLOW:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, QDEC_OVERFLOW_EN, (intMask ? 0 : 1));
    break;

  default:
    break;
  }

  BL_WR_REG(QDECx, QDEC0_INT_EN, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  get QDEC interrupt mask
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                *
                                                                                * @return MASK or UNMASK
                                                                                *
                                                                                *******************************************************************************/
BL_Mask_Type QDEC_GetIntMask(QDEC_ID_Type qdecId, QDEC_INT_Type intType) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  CHECK_PARAM(IS_QDEC_INT_TYPE(intType));

  /* qdec_int_en */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_EN);

  switch (intType) {
  case QDEC_INT_REPORT:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_RPT_RDY_EN) ? UNMASK : MASK;

  case QDEC_INT_SAMPLE:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_SPL_RDY_EN) ? UNMASK : MASK;

