Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_qdec.c
  case QDEC_INT_ERROR:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_DBL_RDY_EN) ? UNMASK : MASK;

  case QDEC_INT_OVERFLOW:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_OVERFLOW_EN) ? UNMASK : MASK;

  default:
    return UNMASK;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC interrupt callback install
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                * @param  cbFun: interrupt callback
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_Int_Callback_Install(QDEC_ID_Type qdecId, QDEC_INT_Type intType, intCallback_Type *cbFun) { qdecIntCbfArra[qdecId][intType] = cbFun; }

/****************************************************************************/ /**
                                                                                * @brief  QDEC get interrupt status
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type QDEC_Get_Int_Status(QDEC_ID_Type qdecId, QDEC_INT_Type intType) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  CHECK_PARAM(IS_QDEC_INT_TYPE(intType));

  /* qdec_int_sts */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_STS);

  switch (intType) {
  case QDEC_INT_REPORT:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_RPT_RDY_STS) ? SET : RESET;

  case QDEC_INT_SAMPLE:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_SPL_RDY_STS) ? SET : RESET;

  case QDEC_INT_ERROR:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_DBL_RDY_STS) ? SET : RESET;

  case QDEC_INT_OVERFLOW:
    return BL_GET_REG_BITS_VAL(tmpVal, QDEC_OVERFLOW_STS) ? SET : RESET;

  default:
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC clear interrupt status
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_Clr_Int_Status(QDEC_ID_Type qdecId, QDEC_INT_Type intType) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  CHECK_PARAM(IS_QDEC_INT_TYPE(intType));

  /* qdec_int_clr */
  tmpVal = BL_RD_REG(QDECx, QDEC0_INT_CLR);

  switch (intType) {
  case QDEC_INT_REPORT:
    tmpVal = BL_SET_REG_BIT(tmpVal, QDEC_RPT_RDY_CLR);
    break;

  case QDEC_INT_SAMPLE:
    tmpVal = BL_SET_REG_BIT(tmpVal, QDEC_SPL_RDY_CLR);
    break;

  case QDEC_INT_ERROR:
    tmpVal = BL_SET_REG_BIT(tmpVal, QDEC_DBL_RDY_CLR);
    break;

  case QDEC_INT_OVERFLOW:
    tmpVal = BL_SET_REG_BIT(tmpVal, QDEC_OVERFLOW_CLR);
    break;

  default:
    break;
  }

  BL_WR_REG(QDECx, QDEC0_INT_CLR, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC get sample direction
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
QDEC_DIRECTION_Type QDEC_Get_Sample_Direction(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* qdec_value */
  tmpVal = BL_RD_REG(QDECx, QDEC0_VALUE);

  return (QDEC_DIRECTION_Type)BL_GET_REG_BITS_VAL(tmpVal, QDEC_SPL_VAL);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC get error count
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
uint8_t QDEC_Get_Err_Cnt(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* qdec_value */
  tmpVal = BL_RD_REG(QDECx, QDEC0_VALUE);

  return BL_GET_REG_BITS_VAL(tmpVal, QDEC_ACC2_VAL);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC get sample value
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
uint16_t QDEC_Get_Sample_Val(QDEC_ID_Type qdecId) {
  uint32_t tmpVal = 0;
  uint32_t QDECx  = qdecAddr[qdecId];

  /* qdec_value */
  tmpVal = BL_RD_REG(QDECx, QDEC0_VALUE);

  return BL_GET_REG_BITS_VAL(tmpVal, QDEC_ACC1_VAL);
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC interrupt handler
                                                                                *
                                                                                * @param  qdecId: QDEC ID
                                                                                * @param  intType: QDEC interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void QDEC_IntHandler(QDEC_ID_Type qdecId, QDEC_INT_Type intType) {
  if (SET == QDEC_Get_Int_Status(qdecId, intType)) {
    QDEC_Clr_Int_Status(qdecId, intType);

    if (qdecIntCbfArra[qdecId][intType] != NULL) {
      qdecIntCbfArra[qdecId][intType]();
    }
  }
}

/****************************************************************************/ /**
                                                                                * @brief  QDEC0 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void QDEC0_IRQHandler(void) {
  QDEC_INT_Type intType;

  for (intType = QDEC_INT_REPORT; intType < QDEC_INT_ALL; intType++) {
    if (UNMASK == QDEC_GetIntMask(QDEC0_ID, intType)) {
      QDEC_IntHandler(QDEC0_ID, intType);
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  QDEC1 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void QDEC1_IRQHandler(void) {
  QDEC_INT_Type intType;

  for (intType = QDEC_INT_REPORT; intType < QDEC_INT_ALL; intType++) {
    if (UNMASK == QDEC_GetIntMask(QDEC1_ID, intType)) {
      QDEC_IntHandler(QDEC1_ID, intType);
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  QDEC2 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void QDEC2_IRQHandler(void) {
  QDEC_INT_Type intType;

  for (intType = QDEC_INT_REPORT; intType < QDEC_INT_ALL; intType++) {
    if (UNMASK == QDEC_GetIntMask(QDEC2_ID, intType)) {
      QDEC_IntHandler(QDEC2_ID, intType);
    }
  }
}
#endif

/*@} end of group QDEC_Private_Functions */

/*@} end of group QDEC */

/*@} end of group BL702_Peripheral_Driver */
